Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32WM_BZ3602_SL3.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="GPIOA">
         <name>GPIOB</name>
         <baseAddress>0x44002B00</baseAddress>
         <interrupt>
            <name>CHANGE_NOTICE_B</name>
            <description>PORT_B_INPUT_CHANGE_INTERRUPT</description>
            <value>5</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>HMATRIX2TOP</name>
         <version>045856.0.0</version>
         <description>HSB Matrix</description>
         <baseAddress>0x42002400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>16</dim>
               <dimIncrement>0x8</dimIncrement>
               <name>PRS[%s]</name>
               <description/>
               <addressOffset>0x080</addressOffset>
               <register>
                  <name>PRAS</name>
                  <description>Priority A for Slave</description>
                  <addressOffset>0x0</addressOffset>
               </register>
               <register>
                  <name>PRBS</name>
                  <description>Priority B for Slave</description>
                  <addressOffset>0x4</addressOffset>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral>
         <name>ITM</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Instrumentation Trace Macrocell</description>
         <baseAddress>0xE0000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <name>PORT_BYTE_MODE[%s]</name>
               <description>ITM Stimulus Port Registers</description>
               <addressOffset>0x0</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PORT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <name>PORT_HWORD_MODE[%s]</name>
               <description>ITM Stimulus Port Registers</description>
               <alternateRegister>PORT_BYTE_MODE[%s]</alternateRegister>
               <addressOffset>0x0</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PORT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <name>PORT_WORD_MODE[%s]</name>
               <description>ITM Stimulus Port Registers</description>
               <alternateRegister>PORT_BYTE_MODE[%s]</alternateRegister>
               <addressOffset>0x0</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PORT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TER</name>
               <description>ITM Trace Enable Register</description>
               <addressOffset>0xE00</addressOffset>
            </register>
            <register>
               <name>TPR</name>
               <description>ITM Trace Privilege Register</description>
               <addressOffset>0xE40</addressOffset>
               <fields>
                  <field>
                     <name>PRIVMASK</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCR</name>
               <description>ITM Trace Control Register</description>
               <addressOffset>0xE80</addressOffset>
               <fields>
                  <field>
                     <name>ITMENA</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSENA</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCENA</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DWTENA</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWOENA</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLENA</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSPrescale</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GTSFREQ</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TraceBusID</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IWR</name>
               <description>ITM Integration Write Register</description>
               <addressOffset>0xEF8</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ATVALIDM</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRR</name>
               <description>ITM Integration Read Register</description>
               <addressOffset>0xEFC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ATREADYM</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID4</name>
               <description>ITM Peripheral Identification Register #4</description>
               <addressOffset>0xFD0</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000004</resetValue>
            </register>
            <register>
               <name>PID5</name>
               <description>ITM Peripheral Identification Register #5</description>
               <addressOffset>0xFD4</addressOffset>
               <access>read-only</access>
            </register>
            <register>
               <name>PID6</name>
               <description>ITM Peripheral Identification Register #6</description>
               <addressOffset>0xFD8</addressOffset>
               <access>read-only</access>
            </register>
            <register>
               <name>PID7</name>
               <description>ITM Peripheral Identification Register #7</description>
               <addressOffset>0xFDC</addressOffset>
               <access>read-only</access>
            </register>
            <register>
               <name>PID0</name>
               <description>ITM Peripheral Identification Register #0</description>
               <addressOffset>0xFE0</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000001</resetValue>
            </register>
            <register>
               <name>PID1</name>
               <description>ITM Peripheral Identification Register #1</description>
               <addressOffset>0xFE4</addressOffset>
               <access>read-only</access>
               <resetValue>0x000000B0</resetValue>
            </register>
            <register>
               <name>PID2</name>
               <description>ITM Peripheral Identification Register #2</description>
               <addressOffset>0xFE8</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000003B</resetValue>
            </register>
            <register>
               <name>PID3</name>
               <description>ITM Peripheral Identification Register #3</description>
               <addressOffset>0xFEC</addressOffset>
               <access>read-only</access>
            </register>
            <register>
               <name>CID0</name>
               <description>ITM Component Identification Register #0</description>
               <addressOffset>0xFF0</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
            </register>
            <register>
               <name>CID1</name>
               <description>ITM Component Identification Register #1</description>
               <addressOffset>0xFF4</addressOffset>
               <access>read-only</access>
               <resetValue>0x000000E0</resetValue>
            </register>
            <register>
               <name>CID2</name>
               <description>ITM Component Identification Register #2</description>
               <addressOffset>0xFF8</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
            </register>
            <register>
               <name>CID3</name>
               <description>ITM Component Identification Register #3</description>
               <addressOffset>0xFFC</addressOffset>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
            </register>
